import React, { Component } from "react";
import { getRandomColor } from "../utils/utils";

class Content extends Component {
  changeColor = (event) => {
    const randomBgColor = getRandomColor();
    const randomTextColor = getRandomColor();
    event.target.style.backgroundColor = randomBgColor;
    event.target.style.color = randomTextColor;
  };

  render() {
    return (
      <div>
        <h3 onClick={this.changeColor}>Дата і місце народження</h3>
        <p>
          12 серпня 2005 року в місті Первомайськ, Миколаївська область,
          Україна.
        </p>
        <h3>Освіта</h3>
        <p>
          У 2022 році закінчив ліцей "Престиж" в місті Первомайськ, вступив до
          НТУУ "Київський політехнічний інститут імені Ігоря Сікорського".
        </p>
        <h3>Хобі</h3>
        <ul>
          <li>Спорт</li>
          <li>Подорожі</li>
          <li>Комп'ютерні ігри</li>
        </ul>
        <h3>Улюблені фільми</h3>
        <ol>
          <li>Інтерстеллар</li>
          <li>Пірати Карибського Моря: Прокляття чорної перлини</li>
          <li>Форсаж 5</li>
        </ol>
        <h3>Улюблене місто</h3>
        <p>
          Бремен — це історичне місто на півночі Німеччини, розташоване на
          річці Везер. Воно відоме своєю багатою культурною спадщиною, зокрема
          готичною архітектурою та знаменитою ратушею, яка входить до списку
          світової спадщини ЮНЕСКО. Однією з головних пам'яток є статуя
          "Бременських музикантів", що символізує казку братів Грімм. Місто є
          важливим торговим та портовим центром, а також пропонує численні
          музеї, театри та зелені парки, що робить його привабливим для
          туристів.
        </p>
      </div>
    );
  }
}

export default Content;
